In [1]:
#ilk ba≈üta verileri pre-process etmek gerekir

In [2]:
import numpy as np
import pandas as pd

In [3]:
arr = np.array([[10,20,np.nan],[5,np.nan,np.nan],[21,np.nan,10]])

In [4]:
arr

array([[10., 20., nan],
       [ 5., nan, nan],
       [21., nan, 10.]])

In [5]:
df = pd.DataFrame(arr, index = "Index1 Index2 Index3".split(" "), columns = "Column1 Column2 Column3".split(" "))

In [6]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [7]:
df.dropna()

Empty DataFrame
Columns: [Column1, Column2, Column3]
Index: []

In [8]:
df.dropna(axis=1)

        Column1
Index1     10.0
Index2      5.0
Index3     21.0

In [9]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [10]:
df.dropna()

Empty DataFrame
Columns: [Column1, Column2, Column3]
Index: []

In [11]:
df.dropna(thresh = 2)#min 2 non olmayan veri varsa onu silme demek...

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index3     21.0      NaN     10.0

In [13]:
df.dropna(thresh = 3)#min 3 non olmayan veri varsa onu silme demek...veri vermemekle aynƒ± ≈üey

Empty DataFrame
Columns: [Column1, Column2, Column3]
Index: []

In [14]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [15]:
#bazen nan ƒ± sƒ±fƒ±r bazen 0 bazen ortalamalarƒ± oraya koymak isteyebiliriz

In [16]:
df.fillna(value = 1)

        Column1  Column2  Column3
Index1     10.0     20.0      1.0
Index2      5.0      1.0      1.0
Index3     21.0      1.0     10.0

In [17]:
df.fillna(value = 100)

        Column1  Column2  Column3
Index1     10.0     20.0    100.0
Index2      5.0    100.0    100.0
Index3     21.0    100.0     10.0

In [18]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [19]:
df.sum()

Column1    36.0
Column2    20.0
Column3    10.0
dtype: float64

In [20]:
df.sum().sum()

66.0

In [22]:
len(df)#yanlƒ±≈ü...

3

In [24]:
df.size#doƒüru...

9

In [25]:
df.isnull()#non sayƒ±larƒ±n toplamƒ±

        Column1  Column2  Column3
Index1    False    False     True
Index2    False     True     True
Index3    False     True    False

In [27]:
df.isnull().sum()#non sayƒ±larƒ±n toplamƒ±

Column1    0
Column2    2
Column3    2
dtype: int64

In [28]:
df.isnull().sum().sum()

4

In [30]:
def calculateMean(df):
    mean = df.sum().sum()/(df.size-(df.isnull().sum().sum()))
    return mean

In [31]:
66/5

13.2

In [33]:
df.fillna(value = calculateMean(df))

        Column1  Column2  Column3
Index1     10.0     20.0     13.2
Index2      5.0     13.2     13.2
Index3     21.0     13.2     10.0

In [34]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [35]:
df.fillna(value = calculateMean(df), inplace = True)

In [36]:
df

        Column1  Column2  Column3
Index1     10.0     20.0     13.2
Index2      5.0     13.2     13.2
Index3     21.0     13.2     10.0